In [1]:
import pandas as pd
import numpy as np

In [3]:
data =pd.read_csv("happiness.csv",header=0)
data.head()

  Country  Gender Mean    N=
0      AT    Male  7.3   471
1     NaN  Female  7.3   570
2     NaN    Both  7.3  1041
3      BE    Male  7.8   468
4     NaN  Female  7.8   542

In [5]:
misdata = data.isnull()
misdata.head(5)

   Country  Gender   Mean     N=
0    False   False  False  False
1     True   False  False  False
2     True   False  False  False
3    False   False  False  False
4     True   False  False  False

In [6]:
for column in misdata.columns.values.tolist():
    print(column)
    print (misdata[column].value_counts())

Country
True     70
False    35
Name: Country, dtype: int64
Gender
False    105
Name: Gender, dtype: int64
Mean
False    105
Name: Mean, dtype: int64
N=
False    105
Name: N=, dtype: int64

In [9]:
data.isnull().any().any()

True

In [10]:
data.isnull().sum()

Country    70
Gender      0
Mean        0
N=          0
dtype: int64

In [11]:
ctg=data.select_dtypes(exclude=[np.number])
ctg.head()

  Country  Gender Mean
0      AT    Male  7.3
1     NaN  Female  7.3
2     NaN    Both  7.3
3      BE    Male  7.8
4     NaN  Female  7.8

In [12]:
ctg['Gender'].unique()

array(['Male', 'Female', 'Both'], dtype=object)

In [18]:
gen_mode = data.Gender.mode()[0]
print("Mode for Gender : ",gen_mode)

Mode for Gender :  Both

In [22]:
Con_mode = data.Country.mode()[0]
print("Mode for Country : ",Con_mode)

Mode for Country :  AT

In [23]:
data.Country.fillna(Con_mode , inplace=True)
data.isna().sum()

Country    0
Gender     0
Mean       0
N=         0
dtype: int64

In [24]:
ctg['Gender'].unique()

array(['Male', 'Female', 'Both'], dtype=object)

In [25]:
ctg.Gender.value_counts()

Male      35
Female    35
Both      35
Name: Gender, dtype: int64

In [30]:
ctg.Gender.replace({"Male":35 ,"Female":34,"Both":33 },inplace=True)

In [27]:
ctg.Country.value_counts()

AT       71
SE        1
MT        1
NL        1
NO        1
PL        1
PT        1
RO        1
SI        1
LV        1
SK        1
TR        1
UK        1
CC3       1
EU 15     1
NMS12     1
MK        1
LU        1
BE        1
GR        1
BG        1
CY        1
CZ        1
DE        1
DK        1
EE        1
ES        1
LT        1
FI        1
FR        1
HR        1
HU        1
IE        1
IT        1
EU 27     1
Name: Country, dtype: int64

In [31]:
data.head()

  Country Gender Mean    N=
0      AT     35  7.3   471
1      AT     35  7.3   570
2      AT     35  7.3  1041
3      BE     35  7.8   468
4      AT     35  7.8   542

In [32]:
data.tail()

    Country Gender Mean     N=
100      AT     35  7.1   7531
101      AT     35  7.2  12819
102   EU 27     35  7.5  13068
103      AT     35  7.5  17366
104      AT     35  7.5  30434